{
  "vocab_size": 1470,
  "old_to_new": {
    "11": 1,
    "16": 2,
    "17": 3,
    "18": 4,
    "19": 5,
    "20": 6,
    "21": 7,
    "22": 8,
    "23": 9,
    "24": 10,
    "25": 11,
    "27": 12,
    "29": 13,
    "36": 14,
    "44": 15,
    "50": 16,
    "58": 17,
    "60": 18,
    "64": 19,
    "66": 20,
    "67": 21,
    "68": 22,
    "70": 23,
    "71": 24,
    "72": 25,
    "75": 26,
    "76": 27,
    "77": 28,
    "78": 29,
    "81": 30,
    "82": 31,
    "83": 32,
    "84": 33,
    "85": 34,
    "198": 35,
    "220": 36,
    "258": 37,
    "259": 38,
    "260": 39,
    "263": 40,
    "267": 41,
    "268": 42,
    "269": 43,
    "274": 44,
    "287": 45,
    "289": 46,
    "300": 47,
    "301": 48,
    "304": 49,
    "308": 50,
    "310": 51,
    "311": 52,
    "312": 53,
    "328": 54,
    "337": 55,
    "352": 56,
    "362": 57,
    "368": 58,
    "372": 59,
    "375": 60,
    "408": 61,
    "412": 62,
    "417": 63,
    "429": 64,
    "478": 65,
    "486": 66,
    "513": 67,
    "518": 68,
    "574": 69,
    "580": 70,
    "600": 71,
    "604": 72,
    "628": 73,
    "642": 74,
    "678": 75,
    "685": 76,
    "718": 77,
    "763": 78,
    "767": 79,
    "772": 80,
    "789": 81,
    "800": 82,
    "807": 83,
    "819": 84,
    "824": 85,
    "838": 86,
    "860": 87,
    "893": 88,
    "915": 89,
    "927": 90,
    "939": 91,
    "940": 92,
    "947": 93,
    "1029": 94,
    "1065": 95,
    "1073": 96,
    "1105": 97,
    "1120": 98,
    "1129": 99,
    "1157": 100,
    "1160": 101,
    "1162": 102,
    "1238": 103,
    "1248": 104,
    "1264": 105,
    "1270": 106,
    "1279": 107,
    "1312": 108,
    "1314": 109,
    "1315": 110,
    "1367": 111,
    "1415": 112,
    "1433": 113,
    "1467": 114,
    "1478": 115,
    "1485": 116,
    "1495": 117,
    "1507": 118,
    "1511": 119,
    "1542": 120,
    "1558": 121,
    "1594": 122,
    "1596": 123,
    "1632": 124,
    "1679": 125,
    "1731": 126,
    "1795": 127,
    "1802": 128,
    "1821": 129,
    "1828": 130,
    "1860": 131,
    "1877": 132,
    "1880": 133,
    "1899": 134,
    "1954": 135,
    "1959": 136,
    "1983": 137,
    "1987": 138,
    "1990": 139,
    "2026": 140,
    "2039": 141,
    "2075": 142,
    "2078": 143,
    "2079": 144,
    "2091": 145,
    "2100": 146,
    "2154": 147,
    "2167": 148,
    "2231": 149,
    "2242": 150,
    "2310": 151,
    "2319": 152,
    "2327": 153,
    "2376": 154,
    "2414": 155,
    "2425": 156,
    "2440": 157,
    "2481": 158,
    "2534": 159,
    "2548": 160,
    "2554": 161,
    "2579": 162,
    "2598": 163,
    "2608": 164,
    "2623": 165,
    "2624": 166,
    "2670": 167,
    "2681": 168,
    "2682": 169,
    "2713": 170,
    "2718": 171,
    "2757": 172,
    "2780": 173,
    "2791": 174,
    "2793": 175,
    "2808": 176,
    "2816": 177,
    "2857": 178,
    "2919": 179,
    "2920": 180,
    "2931": 181,
    "2996": 182,
    "2998": 183,
    "2999": 184,
    "3023": 185,
    "3064": 186,
    "3070": 187,
    "3104": 188,
    "3126": 189,
    "3132": 190,
    "3134": 191,
    "3261": 192,
    "3270": 193,
    "3312": 194,
    "3324": 195,
    "3365": 196,
    "3376": 197,
    "3388": 198,
    "3401": 199,
    "3439": 200,
    "3459": 201,
    "3510": 202,
    "3553": 203,
    "3556": 204,
    "3559": 205,
    "3682": 206,
    "3695": 207,
    "3720": 208,
    "3829": 209,
    "3865": 210,
    "3901": 211,
    "3933": 212,
    "3980": 213,
    "4019": 214,
    "4051": 215,
    "4059": 216,
    "4089": 217,
    "4101": 218,
    "4153": 219,
    "4169": 220,
    "4270": 221,
    "4304": 222,
    "4309": 223,
    "4310": 224,
    "4317": 225,
    "4349": 226,
    "4353": 227,
    "4482": 228,
    "4521": 229,
    "4524": 230,
    "4531": 231,
    "4570": 232,
    "4724": 233,
    "4747": 234,
    "4761": 235,
    "4764": 236,
    "4790": 237,
    "4834": 238,
    "4846": 239,
    "4869": 240,
    "4974": 241,
    "5014": 242,
    "5066": 243,
    "5088": 244,
    "5125": 245,
    "5162": 246,
    "5214": 247,
    "5237": 248,
    "5303": 249,
    "5323": 250,
    "5332": 251,
    "5333": 252,
    "5433": 253,
    "5439": 254,
    "5441": 255,
    "5598": 256,
    "5607": 257,
    "5629": 258,
    "5705": 259,
    "5774": 260,
    "5824": 261,
    "5841": 262,
    "5846": 263,
    "5867": 264,
    "5892": 265,
    "5946": 266,
    "5996": 267,
    "5999": 268,
    "6052": 269,
    "6073": 270,
    "6135": 271,
    "6200": 272,
    "6298": 273,
    "6337": 274,
    "6420": 275,
    "6469": 276,
    "6640": 277,
    "6659": 278,
    "6740": 279,
    "6781": 280,
    "6862": 281,
    "6885": 282,
    "6957": 283,
    "7029": 284,
    "7175": 285,
    "7192": 286,
    "7265": 287,
    "7337": 288,
    "7344": 289,
    "7388": 290,
    "7410": 291,
    "7600": 292,
    "7618": 293,
    "7632": 294,
    "7724": 295,
    "7863": 296,
    "7930": 297,
    "7982": 298,
    "8054": 299,
    "8093": 300,
    "8190": 301,
    "8257": 302,
    "8275": 303,
    "8344": 304,
    "8454": 305,
    "8541": 306,
    "8576": 307,
    "8628": 308,
    "8644": 309,
    "8646": 310,
    "8684": 311,
    "8699": 312,
    "8784": 313,
    "8854": 314,
    "8915": 315,
    "8929": 316,
    "8949": 317,
    "9031": 318,
    "9104": 319,
    "9166": 320,
    "9193": 321,
    "9225": 322,
    "9254": 323,
    "9319": 324,
    "9415": 325,
    "9508": 326,
    "9661": 327,
    "9698": 328,
    "9773": 329,
    "9796": 330,
    "9849": 331,
    "9879": 332,
    "9907": 333,
    "9919": 334,
    "10048": 335,
    "10053": 336,
    "10083": 337,
    "10111": 338,
    "10163": 339,
    "10190": 340,
    "10197": 341,
    "10215": 342,
    "10232": 343,
    "10261": 344,
    "10363": 345,
    "10460": 346,
    "10495": 347,
    "10751": 348,
    "11323": 349,
    "11442": 350,
    "11470": 351,
    "11498": 352,
    "11546": 353,
    "11623": 354,
    "11645": 355,
    "11785": 356,
    "11964": 357,
    "12102": 358,
    "12279": 359,
    "12381": 360,
    "12515": 361,
    "12713": 362,
    "12762": 363,
    "12825": 364,
    "12865": 365,
    "12952": 366,
    "13037": 367,
    "13108": 368,
    "13151": 369,
    "13343": 370,
    "13348": 371,
    "13374": 372,
    "13381": 373,
    "13454": 374,
    "13464": 375,
    "13539": 376,
    "13803": 377,
    "13940": 378,
    "14198": 379,
    "14280": 380,
    "14436": 381,
    "14454": 382,
    "14656": 383,
    "14686": 384,
    "14877": 385,
    "14956": 386,
    "15136": 387,
    "15143": 388,
    "15187": 389,
    "15197": 390,
    "15259": 391,
    "15277": 392,
    "15349": 393,
    "15363": 394,
    "15377": 395,
    "15426": 396,
    "15448": 397,
    "15495": 398,
    "15629": 399,
    "15696": 400,
    "15711": 401,
    "15801": 402,
    "15897": 403,
    "15982": 404,
    "16003": 405,
    "16102": 406,
    "16226": 407,
    "16243": 408,
    "16298": 409,
    "16315": 410,
    "16340": 411,
    "16562": 412,
    "16616": 413,
    "16632": 414,
    "16677": 415,
    "16679": 416,
    "16799": 417,
    "16817": 418,
    "16945": 419,
    "17031": 420,
    "17032": 421,
    "17059": 422,
    "17279": 423,
    "17318": 424,
    "17342": 425,
    "17430": 426,
    "17464": 427,
    "17477": 428,
    "17501": 429,
    "17544": 430,
    "17572": 431,
    "17633": 432,
    "17657": 433,
    "17759": 434,
    "17817": 435,
    "17827": 436,
    "17885": 437,
    "18112": 438,
    "18182": 439,
    "18294": 440,
    "18298": 441,
    "18376": 442,
    "18395": 443,
    "18444": 444,
    "18458": 445,
    "18500": 446,
    "18523": 447,
    "18638": 448,
    "18693": 449,
    "18701": 450,
    "18741": 451,
    "18742": 452,
    "18781": 453,
    "18897": 454,
    "18938": 455,
    "19004": 456,
    "19035": 457,
    "19038": 458,
    "19048": 459,
    "19076": 460,
    "19104": 461,
    "19214": 462,
    "19244": 463,
    "19409": 464,
    "19420": 465,
    "19442": 466,
    "19504": 467,
    "19683": 468,
    "19707": 469,
    "19708": 470,
    "19710": 471,
    "19755": 472,
    "19782": 473,
    "19880": 474,
    "19884": 475,
    "19924": 476,
    "20064": 477,
    "20079": 478,
    "20107": 479,
    "20167": 480,
    "20198": 481,
    "20219": 482,
    "20224": 483,
    "20233": 484,
    "20248": 485,
    "20299": 486,
    "20356": 487,
    "20370": 488,
    "20416": 489,
    "20479": 490,
    "20548": 491,
    "20666": 492,
    "20708": 493,
    "20809": 494,
    "20959": 495,
    "20964": 496,
    "20986": 497,
    "21033": 498,
    "21037": 499,
    "21056": 500,
    "21139": 501,
    "21148": 502,
    "21261": 503,
    "21268": 504,
    "21273": 505,
    "21288": 506,
    "21315": 507,
    "21355": 508,
    "21395": 509,
    "21409": 510,
    "21495": 511,
    "21503": 512,
    "21526": 513,
    "21536": 514,
    "21599": 515,
    "21626": 516,
    "21643": 517,
    "21652": 518,
    "21719": 519,
    "21734": 520,
    "21738": 521,
    "21761": 522,
    "21777": 523,
    "21844": 524,
    "21895": 525,
    "21940": 526,
    "22042": 527,
    "22047": 528,
    "22131": 529,
    "22136": 530,
    "22148": 531,
    "22169": 532,
    "22172": 533,
    "22186": 534,
    "22219": 535,
    "22243": 536,
    "22291": 537,
    "22318": 538,
    "22337": 539,
    "22352": 540,
    "22370": 541,
    "22413": 542,
    "22416": 543,
    "22515": 544,
    "22538": 545,
    "22567": 546,
    "22572": 547,
    "22579": 548,
    "22613": 549,
    "22626": 550,
    "22709": 551,
    "22730": 552,
    "22745": 553,
    "22800": 554,
    "22842": 555,
    "22855": 556,
    "22883": 557,
    "22909": 558,
    "22913": 559,
    "22951": 560,
    "22980": 561,
    "22985": 562,
    "22986": 563,
    "22995": 564,
    "22996": 565,
    "23045": 566,
    "23055": 567,
    "23105": 568,
    "23120": 569,
    "23134": 570,
    "23148": 571,
    "23188": 572,
    "23195": 573,
    "23237": 574,
    "23313": 575,
    "23349": 576,
    "23362": 577,
    "23378": 578,
    "23451": 579,
    "23460": 580,
    "23487": 581,
    "23516": 582,
    "23539": 583,
    "23601": 584,
    "23628": 585,
    "23666": 586,
    "23679": 587,
    "23721": 588,
    "23726": 589,
    "23734": 590,
    "23753": 591,
    "23756": 592,
    "23815": 593,
    "23871": 594,
    "23906": 595,
    "24038": 596,
    "24041": 597,
    "24063": 598,
    "24096": 599,
    "24136": 600,
    "24137": 601,
    "24235": 602,
    "24294": 603,
    "24309": 604,
    "24339": 605,
    "24356": 606,
    "24369": 607,
    "24403": 608,
    "24409": 609,
    "24555": 610,
    "24591": 611,
    "24652": 612,
    "24669": 613,
    "24693": 614,
    "24760": 615,
    "24793": 616,
    "24839": 617,
    "24848": 618,
    "24894": 619,
    "24909": 620,
    "24940": 621,
    "24943": 622,
    "24970": 623,
    "24991": 624,
    "25022": 625,
    "25061": 626,
    "25090": 627,
    "25096": 628,
    "25181": 629,
    "25191": 630,
    "25196": 631,
    "25240": 632,
    "25264": 633,
    "25270": 634,
    "25272": 635,
    "25307": 636,
    "25326": 637,
    "25399": 638,
    "25429": 639,
    "25500": 640,
    "25508": 641,
    "25540": 642,
    "25600": 643,
    "25643": 644,
    "25644": 645,
    "25667": 646,
    "25674": 647,
    "25707": 648,
    "25710": 649,
    "25764": 650,
    "25829": 651,
    "25836": 652,
    "25838": 653,
    "25870": 654,
    "25948": 655,
    "25964": 656,
    "26007": 657,
    "26050": 658,
    "26063": 659,
    "26073": 660,
    "26115": 661,
    "26118": 662,
    "26200": 663,
    "26250": 664,
    "26276": 665,
    "26279": 666,
    "26422": 667,
    "26427": 668,
    "26429": 669,
    "26481": 670,
    "26492": 671,
    "26514": 672,
    "26561": 673,
    "26582": 674,
    "26598": 675,
    "26607": 676,
    "26660": 677,
    "26704": 678,
    "26717": 679,
    "26753": 680,
    "26780": 681,
    "26826": 682,
    "26881": 683,
    "26895": 684,
    "26912": 685,
    "26937": 686,
    "26956": 687,
    "27019": 688,
    "27033": 689,
    "27057": 690,
    "27121": 691,
    "27137": 692,
    "27191": 693,
    "27192": 694,
    "27203": 695,
    "27211": 696,
    "27228": 697,
    "27230": 698,
    "27253": 699,
    "27260": 700,
    "27277": 701,
    "27310": 702,
    "27326": 703,
    "27367": 704,
    "27368": 705,
    "27371": 706,
    "27408": 707,
    "27412": 708,
    "27621": 709,
    "27649": 710,
    "27693": 711,
    "27696": 712,
    "27712": 713,
    "27720": 714,
    "27728": 715,
    "27778": 716,
    "27790": 717,
    "27791": 718,
    "27795": 719,
    "27800": 720,
    "27824": 721,
    "27829": 722,
    "27877": 723,
    "27936": 724,
    "27970": 725,
    "27988": 726,
    "28001": 727,
    "28011": 728,
    "28072": 729,
    "28174": 730,
    "28256": 731,
    "28262": 732,
    "28277": 733,
    "28324": 734,
    "28362": 735,
    "28369": 736,
    "28460": 737,
    "28481": 738,
    "28551": 739,
    "28560": 740,
    "28567": 741,
    "28581": 742,
    "28592": 743,
    "28598": 744,
    "28658": 745,
    "28676": 746,
    "28687": 747,
    "28688": 748,
    "28714": 749,
    "28727": 750,
    "28771": 751,
    "28815": 752,
    "28817": 753,
    "28857": 754,
    "28872": 755,
    "28878": 756,
    "28896": 757,
    "28933": 758,
    "28947": 759,
    "28977": 760,
    "28978": 761,
    "29022": 762,
    "29041": 763,
    "29059": 764,
    "29088": 765,
    "29101": 766,
    "29119": 767,
    "29143": 768,
    "29173": 769,
    "29211": 770,
    "29217": 771,
    "29228": 772,
    "29331": 773,
    "29334": 774,
    "29414": 775,
    "29416": 776,
    "29524": 777,
    "29558": 778,
    "29626": 779,
    "29637": 780,
    "29691": 781,
    "29703": 782,
    "29712": 783,
    "29769": 784,
    "29796": 785,
    "29807": 786,
    "29903": 787,
    "30005": 788,
    "30057": 789,
    "30110": 790,
    "30120": 791,
    "30179": 792,
    "30272": 793,
    "30283": 794,
    "30290": 795,
    "30299": 796,
    "30336": 797,
    "30368": 798,
    "30435": 799,
    "30453": 800,
    "30460": 801,
    "30483": 802,
    "30505": 803,
    "30557": 804,
    "30607": 805,
    "30610": 806,
    "30695": 807,
    "30727": 808,
    "30743": 809,
    "30803": 810,
    "30863": 811,
    "30924": 812,
    "30989": 813,
    "30995": 814,
    "31009": 815,
    "31010": 816,
    "31011": 817,
    "31020": 818,
    "31027": 819,
    "31046": 820,
    "31064": 821,
    "31102": 822,
    "31115": 823,
    "31128": 824,
    "31211": 825,
    "31360": 826,
    "31380": 827,
    "31418": 828,
    "31495": 829,
    "31496": 830,
    "31503": 831,
    "31510": 832,
    "31552": 833,
    "31566": 834,
    "31575": 835,
    "31654": 836,
    "31672": 837,
    "31675": 838,
    "31697": 839,
    "31714": 840,
    "31751": 841,
    "31773": 842,
    "31794": 843,
    "31911": 844,
    "31916": 845,
    "31938": 846,
    "31952": 847,
    "31980": 848,
    "32056": 849,
    "32059": 850,
    "32066": 851,
    "32090": 852,
    "32114": 853,
    "32118": 854,
    "32128": 855,
    "32148": 856,
    "32158": 857,
    "32182": 858,
    "32196": 859,
    "32220": 860,
    "32320": 861,
    "32321": 862,
    "32417": 863,
    "32459": 864,
    "32531": 865,
    "32544": 866,
    "32568": 867,
    "32576": 868,
    "32583": 869,
    "32591": 870,
    "32614": 871,
    "32637": 872,
    "32642": 873,
    "32647": 874,
    "32747": 875,
    "32759": 876,
    "32817": 877,
    "32869": 878,
    "32883": 879,
    "32921": 880,
    "32996": 881,
    "33015": 882,
    "33032": 883,
    "33042": 884,
    "33121": 885,
    "33206": 886,
    "33289": 887,
    "33300": 888,
    "33319": 889,
    "33372": 890,
    "33394": 891,
    "33400": 892,
    "33438": 893,
    "33459": 894,
    "33535": 895,
    "33548": 896,
    "33551": 897,
    "33580": 898,
    "33638": 899,
    "33646": 900,
    "33660": 901,
    "33690": 902,
    "33759": 903,
    "33781": 904,
    "33797": 905,
    "33808": 906,
    "33879": 907,
    "33882": 908,
    "33916": 909,
    "33981": 910,
    "34044": 911,
    "34085": 912,
    "34091": 913,
    "34107": 914,
    "34125": 915,
    "34131": 916,
    "34135": 917,
    "34137": 918,
    "34155": 919,
    "34159": 920,
    "34229": 921,
    "34251": 922,
    "34256": 923,
    "34287": 924,
    "34323": 925,
    "34353": 926,
    "34385": 927,
    "34427": 928,
    "34465": 929,
    "34483": 930,
    "34489": 931,
    "34583": 932,
    "34598": 933,
    "34620": 934,
    "34626": 935,
    "34716": 936,
    "34741": 937,
    "34770": 938,
    "34772": 939,
    "34801": 940,
    "34808": 941,
    "34825": 942,
    "34938": 943,
    "34951": 944,
    "35005": 945,
    "35038": 946,
    "35090": 947,
    "35124": 948,
    "35126": 949,
    "35133": 950,
    "35148": 951,
    "35150": 952,
    "35175": 953,
    "35195": 954,
    "35218": 955,
    "35264": 956,
    "35273": 957,
    "35360": 958,
    "35378": 959,
    "35402": 960,
    "35404": 961,
    "35419": 962,
    "35435": 963,
    "35447": 964,
    "35534": 965,
    "35549": 966,
    "35592": 967,
    "35617": 968,
    "35638": 969,
    "35642": 970,
    "35667": 971,
    "35809": 972,
    "35844": 973,
    "35890": 974,
    "35897": 975,
    "35916": 976,
    "35978": 977,
    "35989": 978,
    "36006": 979,
    "36042": 980,
    "36088": 981,
    "36100": 982,
    "36141": 983,
    "36189": 984,
    "36203": 985,
    "36243": 986,
    "36244": 987,
    "36260": 988,
    "36330": 989,
    "36445": 990,
    "36453": 991,
    "36561": 992,
    "36625": 993,
    "36626": 994,
    "36657": 995,
    "36678": 996,
    "36680": 997,
    "36720": 998,
    "36809": 999,
    "36879": 1000,
    "36928": 1001,
    "36959": 1002,
    "36966": 1003,
    "36993": 1004,
    "37128": 1005,
    "37144": 1006,
    "37224": 1007,
    "37255": 1008,
    "37283": 1009,
    "37290": 1010,
    "37309": 1011,
    "37364": 1012,
    "37381": 1013,
    "37397": 1014,
    "37452": 1015,
    "37466": 1016,
    "37517": 1017,
    "37528": 1018,
    "37563": 1019,
    "37576": 1020,
    "37601": 1021,
    "37680": 1022,
    "37688": 1023,
    "37710": 1024,
    "37730": 1025,
    "37737": 1026,
    "37747": 1027,
    "37750": 1028,
    "37804": 1029,
    "37831": 1030,
    "37856": 1031,
    "37864": 1032,
    "37967": 1033,
    "37988": 1034,
    "38056": 1035,
    "38073": 1036,
    "38089": 1037,
    "38107": 1038,
    "38147": 1039,
    "38158": 1040,
    "38172": 1041,
    "38190": 1042,
    "38205": 1043,
    "38210": 1044,
    "38219": 1045,
    "38249": 1046,
    "38314": 1047,
    "38339": 1048,
    "38369": 1049,
    "38380": 1050,
    "38384": 1051,
    "38431": 1052,
    "38446": 1053,
    "38472": 1054,
    "38547": 1055,
    "38549": 1056,
    "38565": 1057,
    "38569": 1058,
    "38595": 1059,
    "38605": 1060,
    "38612": 1061,
    "38634": 1062,
    "38652": 1063,
    "38703": 1064,
    "38721": 1065,
    "38783": 1066,
    "38819": 1067,
    "38831": 1068,
    "38850": 1069,
    "38867": 1070,
    "38902": 1071,
    "38905": 1072,
    "38907": 1073,
    "38956": 1074,
    "39084": 1075,
    "39088": 1076,
    "39093": 1077,
    "39111": 1078,
    "39118": 1079,
    "39121": 1080,
    "39132": 1081,
    "39135": 1082,
    "39166": 1083,
    "39174": 1084,
    "39195": 1085,
    "39226": 1086,
    "39251": 1087,
    "39254": 1088,
    "39260": 1089,
    "39277": 1090,
    "39320": 1091,
    "39322": 1092,
    "39357": 1093,
    "39380": 1094,
    "39449": 1095,
    "39466": 1096,
    "39506": 1097,
    "39509": 1098,
    "39570": 1099,
    "39595": 1100,
    "39647": 1101,
    "39667": 1102,
    "39697": 1103,
    "39710": 1104,
    "39761": 1105,
    "39768": 1106,
    "39861": 1107,
    "39882": 1108,
    "39885": 1109,
    "39925": 1110,
    "39937": 1111,
    "39997": 1112,
    "40022": 1113,
    "40035": 1114,
    "40064": 1115,
    "40090": 1116,
    "40149": 1117,
    "40173": 1118,
    "40179": 1119,
    "40215": 1120,
    "40248": 1121,
    "40256": 1122,
    "40271": 1123,
    "40286": 1124,
    "40353": 1125,
    "40384": 1126,
    "40385": 1127,
    "40393": 1128,
    "40400": 1129,
    "40401": 1130,
    "40427": 1131,
    "40463": 1132,
    "40486": 1133,
    "40523": 1134,
    "40554": 1135,
    "40585": 1136,
    "40639": 1137,
    "40643": 1138,
    "40652": 1139,
    "40654": 1140,
    "40660": 1141,
    "40675": 1142,
    "40736": 1143,
    "40761": 1144,
    "40873": 1145,
    "40884": 1146,
    "41019": 1147,
    "41060": 1148,
    "41103": 1149,
    "41172": 1150,
    "41234": 1151,
    "41235": 1152,
    "41241": 1153,
    "41247": 1154,
    "41263": 1155,
    "41287": 1156,
    "41289": 1157,
    "41290": 1158,
    "41292": 1159,
    "41417": 1160,
    "41423": 1161,
    "41531": 1162,
    "41544": 1163,
    "41561": 1164,
    "41569": 1165,
    "41580": 1166,
    "41583": 1167,
    "41612": 1168,
    "41647": 1169,
    "41655": 1170,
    "41706": 1171,
    "41717": 1172,
    "41734": 1173,
    "41739": 1174,
    "41761": 1175,
    "41810": 1176,
    "41813": 1177,
    "41820": 1178,
    "41874": 1179,
    "41879": 1180,
    "41922": 1181,
    "41934": 1182,
    "41948": 1183,
    "42018": 1184,
    "42032": 1185,
    "42117": 1186,
    "42141": 1187,
    "42163": 1188,
    "42199": 1189,
    "42215": 1190,
    "42224": 1191,
    "42240": 1192,
    "42250": 1193,
    "42294": 1194,
    "42313": 1195,
    "42321": 1196,
    "42363": 1197,
    "42444": 1198,
    "42489": 1199,
    "42520": 1200,
    "42548": 1201,
    "42622": 1202,
    "42671": 1203,
    "42691": 1204,
    "42716": 1205,
    "42759": 1206,
    "42780": 1207,
    "42802": 1208,
    "42819": 1209,
    "42875": 1210,
    "42947": 1211,
    "42980": 1212,
    "43019": 1213,
    "43134": 1214,
    "43147": 1215,
    "43155": 1216,
    "43184": 1217,
    "43193": 1218,
    "43234": 1219,
    "43239": 1220,
    "43240": 1221,
    "43284": 1222,
    "43292": 1223,
    "43336": 1224,
    "43356": 1225,
    "43364": 1226,
    "43367": 1227,
    "43379": 1228,
    "43452": 1229,
    "43489": 1230,
    "43550": 1231,
    "43564": 1232,
    "43571": 1233,
    "43587": 1234,
    "43610": 1235,
    "43665": 1236,
    "43686": 1237,
    "43690": 1238,
    "43697": 1239,
    "43704": 1240,
    "43722": 1241,
    "43798": 1242,
    "43864": 1243,
    "43916": 1244,
    "43918": 1245,
    "43927": 1246,
    "43950": 1247,
    "44063": 1248,
    "44084": 1249,
    "44085": 1250,
    "44093": 1251,
    "44103": 1252,
    "44169": 1253,
    "44183": 1254,
    "44214": 1255,
    "44218": 1256,
    "44230": 1257,
    "44300": 1258,
    "44341": 1259,
    "44361": 1260,
    "44367": 1261,
    "44387": 1262,
    "44417": 1263,
    "44465": 1264,
    "44468": 1265,
    "44505": 1266,
    "44541": 1267,
    "44550": 1268,
    "44552": 1269,
    "44578": 1270,
    "44586": 1271,
    "44617": 1272,
    "44622": 1273,
    "44626": 1274,
    "44655": 1275,
    "44673": 1276,
    "44675": 1277,
    "44717": 1278,
    "44729": 1279,
    "44750": 1280,
    "44821": 1281,
    "44826": 1282,
    "44856": 1283,
    "44928": 1284,
    "44966": 1285,
    "44969": 1286,
    "44980": 1287,
    "44994": 1288,
    "45021": 1289,
    "45039": 1290,
    "45063": 1291,
    "45068": 1292,
    "45095": 1293,
    "45151": 1294,
    "45191": 1295,
    "45210": 1296,
    "45214": 1297,
    "45326": 1298,
    "45331": 1299,
    "45345": 1300,
    "45385": 1301,
    "45418": 1302,
    "45432": 1303,
    "45439": 1304,
    "45455": 1305,
    "45469": 1306,
    "45473": 1307,
    "45598": 1308,
    "45600": 1309,
    "45601": 1310,
    "45620": 1311,
    "45719": 1312,
    "45720": 1313,
    "45722": 1314,
    "45734": 1315,
    "45758": 1316,
    "45791": 1317,
    "45839": 1318,
    "45881": 1319,
    "45900": 1320,
    "45937": 1321,
    "45959": 1322,
    "45969": 1323,
    "46044": 1324,
    "46096": 1325,
    "46239": 1326,
    "46250": 1327,
    "46302": 1328,
    "46351": 1329,
    "46352": 1330,
    "46393": 1331,
    "46435": 1332,
    "46438": 1333,
    "46503": 1334,
    "46519": 1335,
    "46572": 1336,
    "46588": 1337,
    "46589": 1338,
    "46618": 1339,
    "46633": 1340,
    "46636": 1341,
    "46660": 1342,
    "46720": 1343,
    "46752": 1344,
    "46761": 1345,
    "46815": 1346,
    "46839": 1347,
    "46841": 1348,
    "46871": 1349,
    "46872": 1350,
    "46899": 1351,
    "46900": 1352,
    "46951": 1353,
    "47007": 1354,
    "47101": 1355,
    "47106": 1356,
    "47159": 1357,
    "47233": 1358,
    "47315": 1359,
    "47325": 1360,
    "47338": 1361,
    "47343": 1362,
    "47372": 1363,
    "47396": 1364,
    "47407": 1365,
    "47448": 1366,
    "47493": 1367,
    "47512": 1368,
    "47521": 1369,
    "47567": 1370,
    "47576": 1371,
    "47580": 1372,
    "47582": 1373,
    "47679": 1374,
    "47744": 1375,
    "47760": 1376,
    "47785": 1377,
    "47915": 1378,
    "47941": 1379,
    "47946": 1380,
    "47996": 1381,
    "48005": 1382,
    "48057": 1383,
    "48065": 1384,
    "48096": 1385,
    "48132": 1386,
    "48136": 1387,
    "48156": 1388,
    "48170": 1389,
    "48173": 1390,
    "48194": 1391,
    "48200": 1392,
    "48207": 1393,
    "48246": 1394,
    "48250": 1395,
    "48252": 1396,
    "48284": 1397,
    "48340": 1398,
    "48341": 1399,
    "48365": 1400,
    "48372": 1401,
    "48391": 1402,
    "48475": 1403,
    "48524": 1404,
    "48528": 1405,
    "48531": 1406,
    "48555": 1407,
    "48564": 1408,
    "48581": 1409,
    "48602": 1410,
    "48630": 1411,
    "48634": 1412,
    "48638": 1413,
    "48645": 1414,
    "48655": 1415,
    "48712": 1416,
    "48724": 1417,
    "48758": 1418,
    "48777": 1419,
    "48868": 1420,
    "48882": 1421,
    "48894": 1422,
    "48952": 1423,
    "48964": 1424,
    "49020": 1425,
    "49051": 1426,
    "49087": 1427,
    "49125": 1428,
    "49150": 1429,
    "49211": 1430,
    "49231": 1431,
    "49234": 1432,
    "49259": 1433,
    "49287": 1434,
    "49294": 1435,
    "49327": 1436,
    "49351": 1437,
    "49356": 1438,
    "49447": 1439,
    "49489": 1440,
    "49503": 1441,
    "49517": 1442,
    "49541": 1443,
    "49542": 1444,
    "49561": 1445,
    "49633": 1446,
    "49641": 1447,
    "49649": 1448,
    "49669": 1449,
    "49682": 1450,
    "49689": 1451,
    "49703": 1452,
    "49721": 1453,
    "49803": 1454,
    "49814": 1455,
    "49856": 1456,
    "49888": 1457,
    "49934": 1458,
    "49989": 1459,
    "49995": 1460,
    "50038": 1461,
    "50055": 1462,
    "50080": 1463,
    "50119": 1464,
    "50148": 1465,
    "50150": 1466,
    "50154": 1467,
    "50165": 1468,
    "50242": 1469
  },
  "new_to_old": {
    "1": 11,
    "2": 16,
    "3": 17,
    "4": 18,
    "5": 19,
    "6": 20,
    "7": 21,
    "8": 22,
    "9": 23,
    "10": 24,
    "11": 25,
    "12": 27,
    "13": 29,
    "14": 36,
    "15": 44,
    "16": 50,
    "17": 58,
    "18": 60,
    "19": 64,
    "20": 66,
    "21": 67,
    "22": 68,
    "23": 70,
    "24": 71,
    "25": 72,
    "26": 75,
    "27": 76,
    "28": 77,
    "29": 78,
    "30": 81,
    "31": 82,
    "32": 83,
    "33": 84,
    "34": 85,
    "35": 198,
    "36": 220,
    "37": 258,
    "38": 259,
    "39": 260,
    "40": 263,
    "41": 267,
    "42": 268,
    "43": 269,
    "44": 274,
    "45": 287,
    "46": 289,
    "47": 300,
    "48": 301,
    "49": 304,
    "50": 308,
    "51": 310,
    "52": 311,
    "53": 312,
    "54": 328,
    "55": 337,
    "56": 352,
    "57": 362,
    "58": 368,
    "59": 372,
    "60": 375,
    "61": 408,
    "62": 412,
    "63": 417,
    "64": 429,
    "65": 478,
    "66": 486,
    "67": 513,
    "68": 518,
    "69": 574,
    "70": 580,
    "71": 600,
    "72": 604,
    "73": 628,
    "74": 642,
    "75": 678,
    "76": 685,
    "77": 718,
    "78": 763,
    "79": 767,
    "80": 772,
    "81": 789,
    "82": 800,
    "83": 807,
    "84": 819,
    "85": 824,
    "86": 838,
    "87": 860,
    "88": 893,
    "89": 915,
    "90": 927,
    "91": 939,
    "92": 940,
    "93": 947,
    "94": 1029,
    "95": 1065,
    "96": 1073,
    "97": 1105,
    "98": 1120,
    "99": 1129,
    "100": 1157,
    "101": 1160,
    "102": 1162,
    "103": 1238,
    "104": 1248,
    "105": 1264,
    "106": 1270,
    "107": 1279,
    "108": 1312,
    "109": 1314,
    "110": 1315,
    "111": 1367,
    "112": 1415,
    "113": 1433,
    "114": 1467,
    "115": 1478,
    "116": 1485,
    "117": 1495,
    "118": 1507,
    "119": 1511,
    "120": 1542,
    "121": 1558,
    "122": 1594,
    "123": 1596,
    "124": 1632,
    "125": 1679,
    "126": 1731,
    "127": 1795,
    "128": 1802,
    "129": 1821,
    "130": 1828,
    "131": 1860,
    "132": 1877,
    "133": 1880,
    "134": 1899,
    "135": 1954,
    "136": 1959,
    "137": 1983,
    "138": 1987,
    "139": 1990,
    "140": 2026,
    "141": 2039,
    "142": 2075,
    "143": 2078,
    "144": 2079,
    "145": 2091,
    "146": 2100,
    "147": 2154,
    "148": 2167,
    "149": 2231,
    "150": 2242,
    "151": 2310,
    "152": 2319,
    "153": 2327,
    "154": 2376,
    "155": 2414,
    "156": 2425,
    "157": 2440,
    "158": 2481,
    "159": 2534,
    "160": 2548,
    "161": 2554,
    "162": 2579,
    "163": 2598,
    "164": 2608,
    "165": 2623,
    "166": 2624,
    "167": 2670,
    "168": 2681,
    "169": 2682,
    "170": 2713,
    "171": 2718,
    "172": 2757,
    "173": 2780,
    "174": 2791,
    "175": 2793,
    "176": 2808,
    "177": 2816,
    "178": 2857,
    "179": 2919,
    "180": 2920,
    "181": 2931,
    "182": 2996,
    "183": 2998,
    "184": 2999,
    "185": 3023,
    "186": 3064,
    "187": 3070,
    "188": 3104,
    "189": 3126,
    "190": 3132,
    "191": 3134,
    "192": 3261,
    "193": 3270,
    "194": 3312,
    "195": 3324,
    "196": 3365,
    "197": 3376,
    "198": 3388,
    "199": 3401,
    "200": 3439,
    "201": 3459,
    "202": 3510,
    "203": 3553,
    "204": 3556,
    "205": 3559,
    "206": 3682,
    "207": 3695,
    "208": 3720,
    "209": 3829,
    "210": 3865,
    "211": 3901,
    "212": 3933,
    "213": 3980,
    "214": 4019,
    "215": 4051,
    "216": 4059,
    "217": 4089,
    "218": 4101,
    "219": 4153,
    "220": 4169,
    "221": 4270,
    "222": 4304,
    "223": 4309,
    "224": 4310,
    "225": 4317,
    "226": 4349,
    "227": 4353,
    "228": 4482,
    "229": 4521,
    "230": 4524,
    "231": 4531,
    "232": 4570,
    "233": 4724,
    "234": 4747,
    "235": 4761,
    "236": 4764,
    "237": 4790,
    "238": 4834,
    "239": 4846,
    "240": 4869,
    "241": 4974,
    "242": 5014,
    "243": 5066,
    "244": 5088,
    "245": 5125,
    "246": 5162,
    "247": 5214,
    "248": 5237,
    "249": 5303,
    "250": 5323,
    "251": 5332,
    "252": 5333,
    "253": 5433,
    "254": 5439,
    "255": 5441,
    "256": 5598,
    "257": 5607,
    "258": 5629,
    "259": 5705,
    "260": 5774,
    "261": 5824,
    "262": 5841,
    "263": 5846,
    "264": 5867,
    "265": 5892,
    "266": 5946,
    "267": 5996,
    "268": 5999,
    "269": 6052,
    "270": 6073,
    "271": 6135,
    "272": 6200,
    "273": 6298,
    "274": 6337,
    "275": 6420,
    "276": 6469,
    "277": 6640,
    "278": 6659,
    "279": 6740,
    "280": 6781,
    "281": 6862,
    "282": 6885,
    "283": 6957,
    "284": 7029,
    "285": 7175,
    "286": 7192,
    "287": 7265,
    "288": 7337,
    "289": 7344,
    "290": 7388,
    "291": 7410,
    "292": 7600,
    "293": 7618,
    "294": 7632,
    "295": 7724,
    "296": 7863,
    "297": 7930,
    "298": 7982,
    "299": 8054,
    "300": 8093,
    "301": 8190,
    "302": 8257,
    "303": 8275,
    "304": 8344,
    "305": 8454,
    "306": 8541,
    "307": 8576,
    "308": 8628,
    "309": 8644,
    "310": 8646,
    "311": 8684,
    "312": 8699,
    "313": 8784,
    "314": 8854,
    "315": 8915,
    "316": 8929,
    "317": 8949,
    "318": 9031,
    "319": 9104,
    "320": 9166,
    "321": 9193,
    "322": 9225,
    "323": 9254,
    "324": 9319,
    "325": 9415,
    "326": 9508,
    "327": 9661,
    "328": 9698,
    "329": 9773,
    "330": 9796,
    "331": 9849,
    "332": 9879,
    "333": 9907,
    "334": 9919,
    "335": 10048,
    "336": 10053,
    "337": 10083,
    "338": 10111,
    "339": 10163,
    "340": 10190,
    "341": 10197,
    "342": 10215,
    "343": 10232,
    "344": 10261,
    "345": 10363,
    "346": 10460,
    "347": 10495,
    "348": 10751,
    "349": 11323,
    "350": 11442,
    "351": 11470,
    "352": 11498,
    "353": 11546,
    "354": 11623,
    "355": 11645,
    "356": 11785,
    "357": 11964,
    "358": 12102,
    "359": 12279,
    "360": 12381,
    "361": 12515,
    "362": 12713,
    "363": 12762,
    "364": 12825,
    "365": 12865,
    "366": 12952,
    "367": 13037,
    "368": 13108,
    "369": 13151,
    "370": 13343,
    "371": 13348,
    "372": 13374,
    "373": 13381,
    "374": 13454,
    "375": 13464,
    "376": 13539,
    "377": 13803,
    "378": 13940,
    "379": 14198,
    "380": 14280,
    "381": 14436,
    "382": 14454,
    "383": 14656,
    "384": 14686,
    "385": 14877,
    "386": 14956,
    "387": 15136,
    "388": 15143,
    "389": 15187,
    "390": 15197,
    "391": 15259,
    "392": 15277,
    "393": 15349,
    "394": 15363,
    "395": 15377,
    "396": 15426,
    "397": 15448,
    "398": 15495,
    "399": 15629,
    "400": 15696,
    "401": 15711,
    "402": 15801,
    "403": 15897,
    "404": 15982,
    "405": 16003,
    "406": 16102,
    "407": 16226,
    "408": 16243,
    "409": 16298,
    "410": 16315,
    "411": 16340,
    "412": 16562,
    "413": 16616,
    "414": 16632,
    "415": 16677,
    "416": 16679,
    "417": 16799,
    "418": 16817,
    "419": 16945,
    "420": 17031,
    "421": 17032,
    "422": 17059,
    "423": 17279,
    "424": 17318,
    "425": 17342,
    "426": 17430,
    "427": 17464,
    "428": 17477,
    "429": 17501,
    "430": 17544,
    "431": 17572,
    "432": 17633,
    "433": 17657,
    "434": 17759,
    "435": 17817,
    "436": 17827,
    "437": 17885,
    "438": 18112,
    "439": 18182,
    "440": 18294,
    "441": 18298,
    "442": 18376,
    "443": 18395,
    "444": 18444,
    "445": 18458,
    "446": 18500,
    "447": 18523,
    "448": 18638,
    "449": 18693,
    "450": 18701,
    "451": 18741,
    "452": 18742,
    "453": 18781,
    "454": 18897,
    "455": 18938,
    "456": 19004,
    "457": 19035,
    "458": 19038,
    "459": 19048,
    "460": 19076,
    "461": 19104,
    "462": 19214,
    "463": 19244,
    "464": 19409,
    "465": 19420,
    "466": 19442,
    "467": 19504,
    "468": 19683,
    "469": 19707,
    "470": 19708,
    "471": 19710,
    "472": 19755,
    "473": 19782,
    "474": 19880,
    "475": 19884,
    "476": 19924,
    "477": 20064,
    "478": 20079,
    "479": 20107,
    "480": 20167,
    "481": 20198,
    "482": 20219,
    "483": 20224,
    "484": 20233,
    "485": 20248,
    "486": 20299,
    "487": 20356,
    "488": 20370,
    "489": 20416,
    "490": 20479,
    "491": 20548,
    "492": 20666,
    "493": 20708,
    "494": 20809,
    "495": 20959,
    "496": 20964,
    "497": 20986,
    "498": 21033,
    "499": 21037,
    "500": 21056,
    "501": 21139,
    "502": 21148,
    "503": 21261,
    "504": 21268,
    "505": 21273,
    "506": 21288,
    "507": 21315,
    "508": 21355,
    "509": 21395,
    "510": 21409,
    "511": 21495,
    "512": 21503,
    "513": 21526,
    "514": 21536,
    "515": 21599,
    "516": 21626,
    "517": 21643,
    "518": 21652,
    "519": 21719,
    "520": 21734,
    "521": 21738,
    "522": 21761,
    "523": 21777,
    "524": 21844,
    "525": 21895,
    "526": 21940,
    "527": 22042,
    "528": 22047,
    "529": 22131,
    "530": 22136,
    "531": 22148,
    "532": 22169,
    "533": 22172,
    "534": 22186,
    "535": 22219,
    "536": 22243,
    "537": 22291,
    "538": 22318,
    "539": 22337,
    "540": 22352,
    "541": 22370,
    "542": 22413,
    "543": 22416,
    "544": 22515,
    "545": 22538,
    "546": 22567,
    "547": 22572,
    "548": 22579,
    "549": 22613,
    "550": 22626,
    "551": 22709,
    "552": 22730,
    "553": 22745,
    "554": 22800,
    "555": 22842,
    "556": 22855,
    "557": 22883,
    "558": 22909,
    "559": 22913,
    "560": 22951,
    "561": 22980,
    "562": 22985,
    "563": 22986,
    "564": 22995,
    "565": 22996,
    "566": 23045,
    "567": 23055,
    "568": 23105,
    "569": 23120,
    "570": 23134,
    "571": 23148,
    "572": 23188,
    "573": 23195,
    "574": 23237,
    "575": 23313,
    "576": 23349,
    "577": 23362,
    "578": 23378,
    "579": 23451,
    "580": 23460,
    "581": 23487,
    "582": 23516,
    "583": 23539,
    "584": 23601,
    "585": 23628,
    "586": 23666,
    "587": 23679,
    "588": 23721,
    "589": 23726,
    "590": 23734,
    "591": 23753,
    "592": 23756,
    "593": 23815,
    "594": 23871,
    "595": 23906,
    "596": 24038,
    "597": 24041,
    "598": 24063,
    "599": 24096,
    "600": 24136,
    "601": 24137,
    "602": 24235,
    "603": 24294,
    "604": 24309,
    "605": 24339,
    "606": 24356,
    "607": 24369,
    "608": 24403,
    "609": 24409,
    "610": 24555,
    "611": 24591,
    "612": 24652,
    "613": 24669,
    "614": 24693,
    "615": 24760,
    "616": 24793,
    "617": 24839,
    "618": 24848,
    "619": 24894,
    "620": 24909,
    "621": 24940,
    "622": 24943,
    "623": 24970,
    "624": 24991,
    "625": 25022,
    "626": 25061,
    "627": 25090,
    "628": 25096,
    "629": 25181,
    "630": 25191,
    "631": 25196,
    "632": 25240,
    "633": 25264,
    "634": 25270,
    "635": 25272,
    "636": 25307,
    "637": 25326,
    "638": 25399,
    "639": 25429,
    "640": 25500,
    "641": 25508,
    "642": 25540,
    "643": 25600,
    "644": 25643,
    "645": 25644,
    "646": 25667,
    "647": 25674,
    "648": 25707,
    "649": 25710,
    "650": 25764,
    "651": 25829,
    "652": 25836,
    "653": 25838,
    "654": 25870,
    "655": 25948,
    "656": 25964,
    "657": 26007,
    "658": 26050,
    "659": 26063,
    "660": 26073,
    "661": 26115,
    "662": 26118,
    "663": 26200,
    "664": 26250,
    "665": 26276,
    "666": 26279,
    "667": 26422,
    "668": 26427,
    "669": 26429,
    "670": 26481,
    "671": 26492,
    "672": 26514,
    "673": 26561,
    "674": 26582,
    "675": 26598,
    "676": 26607,
    "677": 26660,
    "678": 26704,
    "679": 26717,
    "680": 26753,
    "681": 26780,
    "682": 26826,
    "683": 26881,
    "684": 26895,
    "685": 26912,
    "686": 26937,
    "687": 26956,
    "688": 27019,
    "689": 27033,
    "690": 27057,
    "691": 27121,
    "692": 27137,
    "693": 27191,
    "694": 27192,
    "695": 27203,
    "696": 27211,
    "697": 27228,
    "698": 27230,
    "699": 27253,
    "700": 27260,
    "701": 27277,
    "702": 27310,
    "703": 27326,
    "704": 27367,
    "705": 27368,
    "706": 27371,
    "707": 27408,
    "708": 27412,
    "709": 27621,
    "710": 27649,
    "711": 27693,
    "712": 27696,
    "713": 27712,
    "714": 27720,
    "715": 27728,
    "716": 27778,
    "717": 27790,
    "718": 27791,
    "719": 27795,
    "720": 27800,
    "721": 27824,
    "722": 27829,
    "723": 27877,
    "724": 27936,
    "725": 27970,
    "726": 27988,
    "727": 28001,
    "728": 28011,
    "729": 28072,
    "730": 28174,
    "731": 28256,
    "732": 28262,
    "733": 28277,
    "734": 28324,
    "735": 28362,
    "736": 28369,
    "737": 28460,
    "738": 28481,
    "739": 28551,
    "740": 28560,
    "741": 28567,
    "742": 28581,
    "743": 28592,
    "744": 28598,
    "745": 28658,
    "746": 28676,
    "747": 28687,
    "748": 28688,
    "749": 28714,
    "750": 28727,
    "751": 28771,
    "752": 28815,
    "753": 28817,
    "754": 28857,
    "755": 28872,
    "756": 28878,
    "757": 28896,
    "758": 28933,
    "759": 28947,
    "760": 28977,
    "761": 28978,
    "762": 29022,
    "763": 29041,
    "764": 29059,
    "765": 29088,
    "766": 29101,
    "767": 29119,
    "768": 29143,
    "769": 29173,
    "770": 29211,
    "771": 29217,
    "772": 29228,
    "773": 29331,
    "774": 29334,
    "775": 29414,
    "776": 29416,
    "777": 29524,
    "778": 29558,
    "779": 29626,
    "780": 29637,
    "781": 29691,
    "782": 29703,
    "783": 29712,
    "784": 29769,
    "785": 29796,
    "786": 29807,
    "787": 29903,
    "788": 30005,
    "789": 30057,
    "790": 30110,
    "791": 30120,
    "792": 30179,
    "793": 30272,
    "794": 30283,
    "795": 30290,
    "796": 30299,
    "797": 30336,
    "798": 30368,
    "799": 30435,
    "800": 30453,
    "801": 30460,
    "802": 30483,
    "803": 30505,
    "804": 30557,
    "805": 30607,
    "806": 30610,
    "807": 30695,
    "808": 30727,
    "809": 30743,
    "810": 30803,
    "811": 30863,
    "812": 30924,
    "813": 30989,
    "814": 30995,
    "815": 31009,
    "816": 31010,
    "817": 31011,
    "818": 31020,
    "819": 31027,
    "820": 31046,
    "821": 31064,
    "822": 31102,
    "823": 31115,
    "824": 31128,
    "825": 31211,
    "826": 31360,
    "827": 31380,
    "828": 31418,
    "829": 31495,
    "830": 31496,
    "831": 31503,
    "832": 31510,
    "833": 31552,
    "834": 31566,
    "835": 31575,
    "836": 31654,
    "837": 31672,
    "838": 31675,
    "839": 31697,
    "840": 31714,
    "841": 31751,
    "842": 31773,
    "843": 31794,
    "844": 31911,
    "845": 31916,
    "846": 31938,
    "847": 31952,
    "848": 31980,
    "849": 32056,
    "850": 32059,
    "851": 32066,
    "852": 32090,
    "853": 32114,
    "854": 32118,
    "855": 32128,
    "856": 32148,
    "857": 32158,
    "858": 32182,
    "859": 32196,
    "860": 32220,
    "861": 32320,
    "862": 32321,
    "863": 32417,
    "864": 32459,
    "865": 32531,
    "866": 32544,
    "867": 32568,
    "868": 32576,
    "869": 32583,
    "870": 32591,
    "871": 32614,
    "872": 32637,
    "873": 32642,
    "874": 32647,
    "875": 32747,
    "876": 32759,
    "877": 32817,
    "878": 32869,
    "879": 32883,
    "880": 32921,
    "881": 32996,
    "882": 33015,
    "883": 33032,
    "884": 33042,
    "885": 33121,
    "886": 33206,
    "887": 33289,
    "888": 33300,
    "889": 33319,
    "890": 33372,
    "891": 33394,
    "892": 33400,
    "893": 33438,
    "894": 33459,
    "895": 33535,
    "896": 33548,
    "897": 33551,
    "898": 33580,
    "899": 33638,
    "900": 33646,
    "901": 33660,
    "902": 33690,
    "903": 33759,
    "904": 33781,
    "905": 33797,
    "906": 33808,
    "907": 33879,
    "908": 33882,
    "909": 33916,
    "910": 33981,
    "911": 34044,
    "912": 34085,
    "913": 34091,
    "914": 34107,
    "915": 34125,
    "916": 34131,
    "917": 34135,
    "918": 34137,
    "919": 34155,
    "920": 34159,
    "921": 34229,
    "922": 34251,
    "923": 34256,
    "924": 34287,
    "925": 34323,
    "926": 34353,
    "927": 34385,
    "928": 34427,
    "929": 34465,
    "930": 34483,
    "931": 34489,
    "932": 34583,
    "933": 34598,
    "934": 34620,
    "935": 34626,
    "936": 34716,
    "937": 34741,
    "938": 34770,
    "939": 34772,
    "940": 34801,
    "941": 34808,
    "942": 34825,
    "943": 34938,
    "944": 34951,
    "945": 35005,
    "946": 35038,
    "947": 35090,
    "948": 35124,
    "949": 35126,
    "950": 35133,
    "951": 35148,
    "952": 35150,
    "953": 35175,
    "954": 35195,
    "955": 35218,
    "956": 35264,
    "957": 35273,
    "958": 35360,
    "959": 35378,
    "960": 35402,
    "961": 35404,
    "962": 35419,
    "963": 35435,
    "964": 35447,
    "965": 35534,
    "966": 35549,
    "967": 35592,
    "968": 35617,
    "969": 35638,
    "970": 35642,
    "971": 35667,
    "972": 35809,
    "973": 35844,
    "974": 35890,
    "975": 35897,
    "976": 35916,
    "977": 35978,
    "978": 35989,
    "979": 36006,
    "980": 36042,
    "981": 36088,
    "982": 36100,
    "983": 36141,
    "984": 36189,
    "985": 36203,
    "986": 36243,
    "987": 36244,
    "988": 36260,
    "989": 36330,
    "990": 36445,
    "991": 36453,
    "992": 36561,
    "993": 36625,
    "994": 36626,
    "995": 36657,
    "996": 36678,
    "997": 36680,
    "998": 36720,
    "999": 36809,
    "1000": 36879,
    "1001": 36928,
    "1002": 36959,
    "1003": 36966,
    "1004": 36993,
    "1005": 37128,
    "1006": 37144,
    "1007": 37224,
    "1008": 37255,
    "1009": 37283,
    "1010": 37290,
    "1011": 37309,
    "1012": 37364,
    "1013": 37381,
    "1014": 37397,
    "1015": 37452,
    "1016": 37466,
    "1017": 37517,
    "1018": 37528,
    "1019": 37563,
    "1020": 37576,
    "1021": 37601,
    "1022": 37680,
    "1023": 37688,
    "1024": 37710,
    "1025": 37730,
    "1026": 37737,
    "1027": 37747,
    "1028": 37750,
    "1029": 37804,
    "1030": 37831,
    "1031": 37856,
    "1032": 37864,
    "1033": 37967,
    "1034": 37988,
    "1035": 38056,
    "1036": 38073,
    "1037": 38089,
    "1038": 38107,
    "1039": 38147,
    "1040": 38158,
    "1041": 38172,
    "1042": 38190,
    "1043": 38205,
    "1044": 38210,
    "1045": 38219,
    "1046": 38249,
    "1047": 38314,
    "1048": 38339,
    "1049": 38369,
    "1050": 38380,
    "1051": 38384,
    "1052": 38431,
    "1053": 38446,
    "1054": 38472,
    "1055": 38547,
    "1056": 38549,
    "1057": 38565,
    "1058": 38569,
    "1059": 38595,
    "1060": 38605,
    "1061": 38612,
    "1062": 38634,
    "1063": 38652,
    "1064": 38703,
    "1065": 38721,
    "1066": 38783,
    "1067": 38819,
    "1068": 38831,
    "1069": 38850,
    "1070": 38867,
    "1071": 38902,
    "1072": 38905,
    "1073": 38907,
    "1074": 38956,
    "1075": 39084,
    "1076": 39088,
    "1077": 39093,
    "1078": 39111,
    "1079": 39118,
    "1080": 39121,
    "1081": 39132,
    "1082": 39135,
    "1083": 39166,
    "1084": 39174,
    "1085": 39195,
    "1086": 39226,
    "1087": 39251,
    "1088": 39254,
    "1089": 39260,
    "1090": 39277,
    "1091": 39320,
    "1092": 39322,
    "1093": 39357,
    "1094": 39380,
    "1095": 39449,
    "1096": 39466,
    "1097": 39506,
    "1098": 39509,
    "1099": 39570,
    "1100": 39595,
    "1101": 39647,
    "1102": 39667,
    "1103": 39697,
    "1104": 39710,
    "1105": 39761,
    "1106": 39768,
    "1107": 39861,
    "1108": 39882,
    "1109": 39885,
    "1110": 39925,
    "1111": 39937,
    "1112": 39997,
    "1113": 40022,
    "1114": 40035,
    "1115": 40064,
    "1116": 40090,
    "1117": 40149,
    "1118": 40173,
    "1119": 40179,
    "1120": 40215,
    "1121": 40248,
    "1122": 40256,
    "1123": 40271,
    "1124": 40286,
    "1125": 40353,
    "1126": 40384,
    "1127": 40385,
    "1128": 40393,
    "1129": 40400,
    "1130": 40401,
    "1131": 40427,
    "1132": 40463,
    "1133": 40486,
    "1134": 40523,
    "1135": 40554,
    "1136": 40585,
    "1137": 40639,
    "1138": 40643,
    "1139": 40652,
    "1140": 40654,
    "1141": 40660,
    "1142": 40675,
    "1143": 40736,
    "1144": 40761,
    "1145": 40873,
    "1146": 40884,
    "1147": 41019,
    "1148": 41060,
    "1149": 41103,
    "1150": 41172,
    "1151": 41234,
    "1152": 41235,
    "1153": 41241,
    "1154": 41247,
    "1155": 41263,
    "1156": 41287,
    "1157": 41289,
    "1158": 41290,
    "1159": 41292,
    "1160": 41417,
    "1161": 41423,
    "1162": 41531,
    "1163": 41544,
    "1164": 41561,
    "1165": 41569,
    "1166": 41580,
    "1167": 41583,
    "1168": 41612,
    "1169": 41647,
    "1170": 41655,
    "1171": 41706,
    "1172": 41717,
    "1173": 41734,
    "1174": 41739,
    "1175": 41761,
    "1176": 41810,
    "1177": 41813,
    "1178": 41820,
    "1179": 41874,
    "1180": 41879,
    "1181": 41922,
    "1182": 41934,
    "1183": 41948,
    "1184": 42018,
    "1185": 42032,
    "1186": 42117,
    "1187": 42141,
    "1188": 42163,
    "1189": 42199,
    "1190": 42215,
    "1191": 42224,
    "1192": 42240,
    "1193": 42250,
    "1194": 42294,
    "1195": 42313,
    "1196": 42321,
    "1197": 42363,
    "1198": 42444,
    "1199": 42489,
    "1200": 42520,
    "1201": 42548,
    "1202": 42622,
    "1203": 42671,
    "1204": 42691,
    "1205": 42716,
    "1206": 42759,
    "1207": 42780,
    "1208": 42802,
    "1209": 42819,
    "1210": 42875,
    "1211": 42947,
    "1212": 42980,
    "1213": 43019,
    "1214": 43134,
    "1215": 43147,
    "1216": 43155,
    "1217": 43184,
    "1218": 43193,
    "1219": 43234,
    "1220": 43239,
    "1221": 43240,
    "1222": 43284,
    "1223": 43292,
    "1224": 43336,
    "1225": 43356,
    "1226": 43364,
    "1227": 43367,
    "1228": 43379,
    "1229": 43452,
    "1230": 43489,
    "1231": 43550,
    "1232": 43564,
    "1233": 43571,
    "1234": 43587,
    "1235": 43610,
    "1236": 43665,
    "1237": 43686,
    "1238": 43690,
    "1239": 43697,
    "1240": 43704,
    "1241": 43722,
    "1242": 43798,
    "1243": 43864,
    "1244": 43916,
    "1245": 43918,
    "1246": 43927,
    "1247": 43950,
    "1248": 44063,
    "1249": 44084,
    "1250": 44085,
    "1251": 44093,
    "1252": 44103,
    "1253": 44169,
    "1254": 44183,
    "1255": 44214,
    "1256": 44218,
    "1257": 44230,
    "1258": 44300,
    "1259": 44341,
    "1260": 44361,
    "1261": 44367,
    "1262": 44387,
    "1263": 44417,
    "1264": 44465,
    "1265": 44468,
    "1266": 44505,
    "1267": 44541,
    "1268": 44550,
    "1269": 44552,
    "1270": 44578,
    "1271": 44586,
    "1272": 44617,
    "1273": 44622,
    "1274": 44626,
    "1275": 44655,
    "1276": 44673,
    "1277": 44675,
    "1278": 44717,
    "1279": 44729,
    "1280": 44750,
    "1281": 44821,
    "1282": 44826,
    "1283": 44856,
    "1284": 44928,
    "1285": 44966,
    "1286": 44969,
    "1287": 44980,
    "1288": 44994,
    "1289": 45021,
    "1290": 45039,
    "1291": 45063,
    "1292": 45068,
    "1293": 45095,
    "1294": 45151,
    "1295": 45191,
    "1296": 45210,
    "1297": 45214,
    "1298": 45326,
    "1299": 45331,
    "1300": 45345,
    "1301": 45385,
    "1302": 45418,
    "1303": 45432,
    "1304": 45439,
    "1305": 45455,
    "1306": 45469,
    "1307": 45473,
    "1308": 45598,
    "1309": 45600,
    "1310": 45601,
    "1311": 45620,
    "1312": 45719,
    "1313": 45720,
    "1314": 45722,
    "1315": 45734,
    "1316": 45758,
    "1317": 45791,
    "1318": 45839,
    "1319": 45881,
    "1320": 45900,
    "1321": 45937,
    "1322": 45959,
    "1323": 45969,
    "1324": 46044,
